#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dcentric-health/gh-actions-vault/runs/run-PkLjFZ6BdwADDbi9

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.default: Reading...
data.aws_ami.selected: Reading...
data.aws_ami.selected: Read complete after 1s [id=ami-01484fd504342261b]
data.aws_vpc.default: Read complete after 1s [id=vpc-ff49b386]
data.aws_subnet_ids.all: Reading...
module.loadbalancer_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0e42f75c08f4c8553]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad]
module.instance_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-01540647fb1a33ec2]
data.aws_subnet_ids.all: Read complete after 0s [id=vpc-ff49b386]
module.instance_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2913057454]
aws_launch_template.this: Refreshing state... [id=lt-0afbad080f4ad42e8]
module.instance_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1208296655]
module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1115908147]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:loadbalancer/app/test-rolling/5881a8d833c68349]
module.loadbalancer_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1212846356]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/test-rolling/5881a8d833c68349/fc67da85a67017e4]
aws_cloudformation_stack.this: Refreshing state... [id=arn:aws:cloudformation:eu-west-1:277142373668:stack/test-rolling/d2dfc8f0-5d33-11ed-93b5-02f6ef265489]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cloudformation_stack.this will be updated in-place
  ~ resource "aws_cloudformation_stack" "this" {
        id                 = "arn:aws:cloudformation:eu-west-1:277142373668:stack/test-rolling/d2dfc8f0-5d33-11ed-93b5-02f6ef265489"
        name               = "test-rolling"
        tags               = {}
      ~ template_body      = <<-EOT
            Resources:
              ASG:
                Type: AWS::AutoScaling::AutoScalingGroup
                Properties:
                  AutoScalingGroupName: "test-rolling"
                  HealthCheckGracePeriod: 300
                  DesiredCapacity: 2
                  MaxSize: 2
                  MinSize: 1
                  VPCZoneIdentifier: ["subnet-51d5e237","subnet-5315131b","subnet-6d0f7f37"]
                  TargetGroupARNs: ["arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad"]
                  Tags: []
                  HealthCheckType: EC2
            
                  MixedInstancesPolicy:
                    InstancesDistribution:
                      OnDemandBaseCapacity: 0
                      OnDemandPercentageAboveBaseCapacity: 0
                      SpotAllocationStrategy: capacity-optimized
                    LaunchTemplate:
                      LaunchTemplateSpecification:
                        LaunchTemplateName: "test-rolling20221105175905155600000004"
                        Version: "1"
                      Overrides: []
            
                UpdatePolicy:
                # Ignore differences in group size properties caused by scheduled actions
                  AutoScalingScheduledAction:
                    IgnoreUnmodifiedGroupSizeProperties: true
                  AutoScalingRollingUpdate:
                    MinSuccessfulInstancesPercent: 50
                    PauseTime: PT10M
                    SuspendProcesses:
                      - HealthCheck
                      - ReplaceUnhealthy
                      - AZRebalance
                      - AlarmNotification
                      - ScheduledActions
                    WaitOnResourceSignals: true
            
                DeletionPolicy: Delete
        EOT -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-0afbad080f4ad42e8"
      ~ image_id                = "ami-0532a9d941ac88c21" -> "ami-01484fd504342261b"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "test-rolling20221105175905155600000004"
        tags                    = {}
        # (10 unchanged attributes hidden)

      ~ network_interfaces {
          ~ security_groups             = [
              - "sg-01540647fb1a33ec2",
            ] -> (known after apply)
            # (12 unchanged attributes hidden)
        }
    }

  # module.alb.aws_lb.this[0] will be updated in-place
  ~ resource "aws_lb" "this" {
        id                         = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:loadbalancer/app/test-rolling/5881a8d833c68349"
        name                       = "test-rolling"
      ~ security_groups            = [
          - "sg-0e42f75c08f4c8553",
        ] -> (known after apply)
        tags                       = {
            "Name" = "test-rolling"
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.alb.aws_lb_listener.frontend_http_tcp[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:listener/app/test-rolling/5881a8d833c68349/fc67da85a67017e4"
      ~ port              = 80 -> 443
      ~ protocol          = "HTTP" -> "HTTPS"
        tags              = {}
        # (3 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.alb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/h120221105175903169200000003/1eaec8046ee69dad" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:277142373668:targetgroup/h120221105175903169200000003/1eaec8046ee69dad" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "h120221105175903169200000003" -> (known after apply)
      ~ port                               = 80 -> 443 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol                           = "HTTP" -> "HTTPS" # forces replacement
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Name" = "h1"
        }
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ protocol            = "HTTP" -> "HTTPS"
            # (8 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # module.instance_sg.aws_security_group.this_name_prefix[0] must be replaced
+/- resource "aws_security_group" "this_name_prefix" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:277142373668:security-group/sg-01540647fb1a33ec2" -> (known after apply)
      ~ description            = "Security group for example usage with EC2 Instances" -> "Security group for EC2 Instances" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS"
              - from_port        = 443
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ id                     = "sg-01540647fb1a33ec2" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Ingress Rule"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0e42f75c08f4c8553",
                ]
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ name                   = "test-rolling_instances_sg-20221105175903166000000002" -> (known after apply)
      ~ owner_id               = "277142373668" -> (known after apply)
        tags                   = {
            "Name" = "test-rolling_instances_sg"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.instance_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0] must be replaced
-/+ resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      ~ from_port                = 80 -> 443 # forces replacement
      ~ id                       = "sgrule-1208296655" -> (known after apply)
      ~ security_group_id        = "sg-01540647fb1a33ec2" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-0e42f75c08f4c8553" -> (known after apply) # forces replacement
      ~ to_port                  = 80 -> 443 # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.instance_sg.aws_security_group_rule.egress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "egress_rules" {
      ~ id                       = "sgrule-2913057454" -> (known after apply)
      ~ security_group_id        = "sg-01540647fb1a33ec2" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.loadbalancer_sg.aws_security_group.this_name_prefix[0] must be replaced
+/- resource "aws_security_group" "this_name_prefix" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:277142373668:security-group/sg-0e42f75c08f4c8553" -> (known after apply)
      ~ description            = "Security group for example usage with ALB" -> "Security group for ALB" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Egress Rule"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-01540647fb1a33ec2",
                ]
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ id                     = "sg-0e42f75c08f4c8553" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ name                   = "test-rolling_lb_sg-20221105175903164500000001" -> (known after apply)
      ~ owner_id               = "277142373668" -> (known after apply)
        tags                   = {
            "Name" = "test-rolling_lb_sg"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.loadbalancer_sg.aws_security_group_rule.computed_egress_with_source_security_group_id[0] must be replaced
-/+ resource "aws_security_group_rule" "computed_egress_with_source_security_group_id" {
      ~ from_port                = 80 -> 443 # forces replacement
      ~ id                       = "sgrule-1212846356" -> (known after apply)
      ~ security_group_id        = "sg-0e42f75c08f4c8553" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-01540647fb1a33ec2" -> (known after apply) # forces replacement
      ~ to_port                  = 80 -> 443 # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "ingress_rules" {
      ~ description              = "HTTP" -> "HTTPS"
      ~ from_port                = 80 -> 443 # forces replacement
      ~ id                       = "sgrule-1115908147" -> (known after apply)
      ~ security_group_id        = "sg-0e42f75c08f4c8553" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
      ~ to_port                  = 80 -> 443 # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 7 to add, 4 to change, 7 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with data.aws_subnet_ids.all,
│   on data.tf line 5, in data "aws_subnet_ids" "all":
│    5: data "aws_subnet_ids" "all" {
│ 
│ The aws_subnet_ids data source has been deprecated and will be removed in a
│ future version. Use the aws_subnets data source instead.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @linerocks, Action: `pull_request`*